app/controllers/comments_controller.rb

SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", "2"]]
INSERT INTO "comments" ("body", "commenter", "created_at", "post_id", "updated_at") VALUES (?, ?, ?, ?, ?)  [["body", "Esto es una prueba de comentario"], ["commenter", "Pepito"], ["created_at", Tue, 26 Jun 2012 15:11:33 UTC +00:00], ["post_id", 2], ["updated_at", Tue, 26 Jun 2012 15:11:33 UTC +00:00]]
---
   def create
      @post = Post.find(params[:post_id])
      @comment = @post.comments.create(params[:comment])