app/controllers/posts_controller.rb

INSERT INTO "posts" ("content", "created_at", "name", "title", "updated_at") VALUES (?, ?, ?, ?, ?)  [["content", "Primeros pasos en rails"], ["created_at", Mon, 25 Jun 2012 16:51:19 UTC +00:00], ["name", "Eleazar"], ["title", "Prueba"], ["updated_at", Mon, 25 Jun 2012 16:51:19 UTC +00:00]]
---
  def create
    @post = Post.new(params[:post])

    respond_to do |format|
      if @post.save

SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", "2"]]
UPDATE "posts" SET "content" = 'Se trata de seguir la guía de comienzo de RoR prueba', "updated_at" = '2012-06-25 19:43:44.087361' WHERE "posts"."id" = 2
---
  def update
    @post = Post.find(params[:id])

    respond_to do |format|
      if @post.update_attributes(params[:post])